---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeHasMonolithicSupport
source: html/be1e98a4-2e2f-c3c4-f889-b3f77cb51b56.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeHasMonolithicSupport Property

"Monolithic Support": Monolithic Support

## Syntax (C#)
```csharp
public static ForgeTypeId StairsLandingtypeHasMonolithicSupport { get; }
```